#include "ntddk.h"
#include "..\Headers\driverforMR.h"
#include <string.h>
#include <stdio.h>

#pragma pack(1)

typedef struct _SEGMENT_DESCRIPTOR_TABLE {
	USHORT Limit;
	ULONG Base;
}SEGMENT_DESCRIPTOR_TABLE, *PSEGMENT_DESCRIPTOR_TABLE;

typedef struct _SEGMENT_DESCRIPTOR_INFO{
	ULONG Base;
	ULONG Limit;
	UCHAR AccessByte;
	UCHAR Flags;
}SEGMENT_DESCRIPTOR_INFO, *PSEGMENT_DESCRIPTOR_INFO;

typedef struct _HISTORY_OBJECT {
	LIST_ENTRY ListEntry;
	ULONG StartAddress;
	ULONG Length;		// The first byte is flag and the following bytes are used for hashing.
	PVOID Buffer;
}HISTORY_OBJECT, *PHISTORY_OBJECT;

typedef struct _BACKUP_OBJECT {
	ULONG OriginalEthread;
	ULONG OriginalEprocess;
	ULONG OriginalCR3;
	ULONG OriginalHyperPte;
	PSEGMENT_DESCRIPTOR_INFO pSegmentInfoForFS;	// It's for the Current Processor's KPCR[Processor Control Region].
}BACKUP_OBJECT, *PBACKUP_OBJECT;

typedef struct _REQUIRED_OFFSET_ENTRY {
	LIST_ENTRY ListEntry;
	struct _REQUIRED_OFFSET Required;
} REQUIRED_OFFSET_ENTRY, *PREQUIRED_OFFSET_ENTRY;

typedef struct _TARGET_PROCESS {
	ULONG ProcessId;
	PEPROCESS pEprocess;
	ULONG pVadRoot;
	PMDL pUsingMdl;
	LIST_ENTRY HistoryHead;
}TARGET_PROCESS, *PTARGET_PROCESS;

typedef struct _DEVICE_EXTENSION {
	LIST_ENTRY MessageListHead;
	KSPIN_LOCK MessageLock;
	PETHREAD pCommunicationThread;
	KSEMAPHORE CommunicationThreadSemaphore;
	PIRP PendingIRP;
	KSPIN_LOCK PendingIRPLock; 
	KEVENT PendingIRPEvent;
	BOOLEAN bTerminate;
	PTARGET_PROCESS pTargetProcess;
	PBACKUP_OBJECT pBackupObject;
	LIST_ENTRY RequiredOffsetCache;
	KEVENT RequiredOffsetEvent;
} DEVICE_EXTENSION, *PDEVICE_EXTENSION;

typedef struct _MESSAGE_ENTRY {
	LIST_ENTRY ListEntry;
	PMESSAGE_FORM pMessageForm;
} MESSAGE_ENTRY, *PMESSAGE_ENTRY;


#pragma pack()
/////////////////////////////////////////////////////////////////////////////
/////////////////////////////////////////////////////////////////////////////
/////////////////////////////////////////////////////////////////////////////
DRIVER_INITIALIZE DriverEntry;
DRIVER_DISPATCH DispatchRoutine;
DRIVER_DISPATCH DispatchRead;
//DRIVER_DISPATCH DispatchWrite;
DRIVER_DISPATCH DispatchControl;
DRIVER_CANCEL CancelMessageIRP;
DRIVER_UNLOAD UnLoad;

//NTSTATUS WorkerStarter(PDEVICE_EXTENSION, PMESSAGE_FORM);
NTSTATUS ConnectWithApplication(PDEVICE_EXTENSION);
NTSTATUS InitializeTargetProcess(PDEVICE_EXTENSION, USHORT, PWCHAR);
NTSTATUS GetKernelObjectDumper(PDEVICE_EXTENSION, PWCHAR, ULONG);
BOOLEAN MessageMaker(USHORT, PVOID, ULONG);
LONG GetRequiredOffsets(PWCHAR, PWCHAR); 
VOID CachingRequiredOffset(PDEVICE_EXTENSION, PREQUIRED_OFFSET);
VOID RemoveTargetProcess(PDEVICE_EXTENSION);

// THREAD.
KSTART_ROUTINE CommunicationThread;
//KSTART_ROUTINE WorkerThread;

// For Test....
//VOID TestForMessageQueuing(ULONG);
VOID ShowByteStreamToDbg(PUCHAR, ULONG);
/////////////////////////////////////////////////////////////////////////////
/////////////////////////////////////////////////////////////////////////////
/////////////////////////////////////////////////////////////////////////////


WCHAR nameBuffer[] = L"\\Device\\MemoryReviewer";
WCHAR linkBuffer[] = L"\\DosDevices\\MemoryReviewer";
PDEVICE_OBJECT pMyDevice = NULL;

BOOLEAN isStartedUserCommunicationThread = FALSE;


////////////////////////// 세그먼트 셀렉터 다루는 함수 만들어야 함.
//		-> LDT가 좀 이상함.. 하나하나 값 확인해볼 것.
/*
LDT 필드 갖고 있는 오브젝트들:
	_KPROCESS
		+0x01c LdtDescriptor    : _KGDTENTRY	[8]
			+0x000 LimitLow         : Uint2B
			+0x002 BaseLow          : Uint2B
			+0x004 HighWord         : <unnamed-tag>

	_EPROCESS
		+0x144 LdtInformation   : Ptr32 Void 	[4]

	_KPCR
		+0x000 NtTib            : _NT_TIB
		+0x020 Prcb             : Ptr32 _KPRCB
		+0x038 IDT              : Ptr32 _KIDTENTRY
			+0x000 Offset           : Uint2B
			+0x002 Selector         : Uint2B
			+0x004 Access           : Uint2B
			+0x006 ExtendedOffset   : Uint2B
		+0x03c GDT              : Ptr32 _KGDTENTRY
			+0x000 LimitLow         : Uint2B
			+0x002 BaseLow          : Uint2B
			+0x004 HighWord         : <unnamed-tag>
				+0x000 Bytes            : <unnamed-tag>
				+0x000 Bits             : <unnamed-tag>
		+0x040 TSS              : Ptr32 _KTSS
			+0x060 LDT              : Uint2B
*/


PSEGMENT_DESCRIPTOR_INFO SegmentDescriptorParser(USHORT SegmentSelector) {
	SEGMENT_DESCRIPTOR_TABLE gdtr;		// LDT 구조 확인 후에도 Limit 값 쓸 일 없으면, 이 구조체 제거 후 pCurrentEntry로 사용.
	PSEGMENT_DESCRIPTOR_INFO pSegmentInfo = NULL;
	PULONG pCurrentEntry = NULL;
	BOOLEAN isLocalDescriptorTable = (SegmentSelector & 0x4) ? TRUE : FALSE;		
	UCHAR dbgPrefix[] = "::: IN SEGMENT DESCRIPTOR PARSER : ";

	SegmentSelector = SegmentSelector >> 3;
	if (SegmentSelector) {
		RtlZeroMemory(&gdtr, sizeof(SEGMENT_DESCRIPTOR_TABLE));
		__asm sgdt gdtr;
		if (gdtr.Base && gdtr.Limit) {
			pSegmentInfo = ExAllocatePool(NonPagedPool, sizeof(SEGMENT_DESCRIPTOR_INFO));
			if (pSegmentInfo) {
			LDTPARSING:
				RtlZeroMemory(pSegmentInfo, sizeof(SEGMENT_DESCRIPTOR_INFO));
				pCurrentEntry = (PULONG)(gdtr.Base + (8 * SegmentSelector));

				// Parsing...
				pSegmentInfo->Limit = (pCurrentEntry[0] & 0xFFFF);
				pSegmentInfo->Limit += ((pCurrentEntry[1]) & 0xF0000);

